Revit 2023 API
RuledSurface Class
 A ruled surface is created by sweeping a line between two profile curves or between a curve and a point (a point and a curve). Input curve(s) must be bounded or have natural bounds.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2017
Syntax
C#
public class RuledSurface : Surface
Visual Basic
Public Class RuledSurface _
	Inherits Surface
Visual C++
public ref class RuledSurface : public Surface
Remarks
 Both curves are evaluated in normalized parameters [0, 1] The parametric equations of a ruled surface are: C1 != 0 and C2 != 0 : S(u, v) = C1(u) + v * (C2(u) - C1(u)); C2 == 0 and C1 != 0 : S(u, v) = P1 + v * (C2(u) - P1); C1 == 0 and C2 != 0 : S(u, v) = C1(u) + v * (P2 - C1(u)); C1 == 0 and C2 == 0 - is not allowed as that would define a degenerate ruled surface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 Autodesk.Revit.DB.RuledSurface
See Also
RuledSurface Members
Autodesk.Revit.DB Namespace